{"description": "Here&#8217;s an unexpected but pleasant little way tech might be able to improve a few lives: laser shoes. Yes, seriously. Shoes equipped with small laser emitters were shown in recent tests to help sufferers of Parkinson&#8217;s disease to walk normally. Read More", "title": "Laser-equipped shoes help Parkinson’s patients take the next step", "author": "Devin Coldewey", "publish_date": "Fri, 22 Dec 2017 00:53:18 +0000", "link": "https://techcrunch.com/2017/12/21/laser-equipped-shoes-help-parkinsons-patients-take-the-next-step/?ncid=rss", "categories": "Gadgets"}
{"description": "The Max sounds good. But is it $399 good? On the whole, it&#8217;s a solid offering. It isn&#8217;t a flashy speaker from a design perspective, but the audio is loud and clear, and the bass bumps like a mofo. Read More", "title": "Google Home Max review", "author": "Brian Heater", "publish_date": "Fri, 22 Dec 2017 00:18:33 +0000", "link": "https://techcrunch.com/2017/12/21/google-home-max-review/?ncid=rss", "categories": "Health"}
{"description": "I watch with increasing trepidation at the direction Apple is taking its products. The most recent concern came yesterday from Bloomberg that Apple intends to offer its software developers new libraries that will allow apps to serve both touchscreen interfaces like the iPhone as well as traditional mouse and keyboard setups on desktop computers using a single unified set of APIs. Read More", "title": "Apple’s Design Delirium", "author": "Danny Crichton", "publish_date": "Thu, 21 Dec 2017 23:27:16 +0000", "link": "https://techcrunch.com/2017/12/21/apples-design-delirium/?ncid=rss", "categories": "Science"}
{"description": "More than a year and a half ago, I wrote about Coach, a startup offering tools for tutors and other freelancers to make money and operate their business online. Since then, the company has shifted focus in a big way, and it recently announced that it&#8217;s raised $3 million in seed funding. It&#8217;s got a new name, too &#8212; Podia. Read More", "title": "Podia helps content creators build their online business", "author": "Anthony Ha", "publish_date": "Thu, 21 Dec 2017 23:03:44 +0000", "link": "https://techcrunch.com/2017/12/21/coach-becomes-podia/?ncid=rss", "categories": "TC"}
{"description": "A bipartisan group of lawmakers in the Senate has introduced a bill designed to protect the technical integrity of American elections as the nation moves toward midterm season. Introduced in the Senate, the bill known as the Secure Elections Act. Read More", "title": "A new bipartisan Senate bill seeks to bolster US election security at the state level", "author": "Taylor Hatmaker", "publish_date": "Thu, 21 Dec 2017 22:58:15 +0000", "link": "https://techcrunch.com/2017/12/21/secure-elections-act/?ncid=rss", "categories": "Wearables"}
{"description": "Huge numbers of people are upset at the FCC&#8217;s decision to undo its own highly popular net neutrality rules. But the grand plans to undo this mischief being announced left and right should be taken with a grain of salt. Unfortunately, it all comes down to politics. Read More", "title": "There’s no magic bullet for reversing the FCC’s net neutrality decision", "author": "Devin Coldewey", "publish_date": "Thu, 21 Dec 2017 22:45:43 +0000", "link": "https://techcrunch.com/2017/12/21/theres-no-magic-bullet-for-reversing-the-fccs-net-neutrality-decision/?ncid=rss", "categories": "Parkinson's Disease"}
{"description": "A little late in the day news dump for you, ahead of the upcoming holiday. Longtime Google executive Eric Schmidt announced today that he&#8217;ll be stepping down from his role as the executive chairman of Alphabet&#8217;s board of directors. Alphabet has confirmed the move with TechCrunch. Read More", "title": "Eric Schmidt stepping down as Alphabet’s executive chairman to become a ‘technical advisor’", "author": "Brian Heater", "publish_date": "Thu, 21 Dec 2017 22:27:42 +0000", "link": "https://techcrunch.com/2017/12/21/eric-schmidt-stepping-down-as-alphabets-executive-chairman-to-become-a-technical-advisor/?ncid=rss", "categories": "lasers"}
{"description": "Millions of people engage with artificial intelligence (AI) in some form every day &#8212; most of them unwittingly. It&#8217;s at our fingertips through applications people from all over the world use regularly. That&#8217;s why it&#8217;s more important than ever to launch, and sustain, a global effort to improve the transparency of AI in order to shed light on the technology. Read More", "title": "How to unmask AI", "author": "Kriti Sharma", "publish_date": "Thu, 21 Dec 2017 22:00:00 +0000", "link": "https://techcrunch.com/2017/12/21/how-to-unmask-ai/?ncid=rss", "categories": "medtech"}
{"description": "Despite repeal of the Affordable Care Act&#8217;s individual mandate this week, health insurance startup Oscar Health expects to pull in nearly $1 billion in revenue and enroll a quarter of a million members in 2018. The revenue prediction first reported in Axios and signups are quite a feat for the insurance company meant for the digital age. Read More", "title": "Oscar Health expects to generate $1 billion in revenue and sign up 250,000 members in 2018", "author": "Sarah Buhr", "publish_date": "Thu, 21 Dec 2017 20:52:15 +0000", "link": "https://techcrunch.com/2017/12/21/oscar-health-expects-to-generate-1-billion-in-revenue-and-sign-up-250000-members-in-2018/?ncid=rss", "categories": "Gadgets"}
{"description": "Instagram has been beefing up its Direct Messaging feature as it toys with the idea of spinning out messaging into its own, separate app. Among its more recent tweaks: the added option for photo and video message replays, and enhancements like support for web links and different photo orientations. Today, it&#8217;s rolling out another change &#8212; live videos over Direct Messaging. Read More", "title": "Instagram now lets you share live videos through direct messages", "author": "Sarah Perez", "publish_date": "Thu, 21 Dec 2017 20:21:22 +0000", "link": "https://techcrunch.com/2017/12/21/instagram-now-lets-you-share-live-videos-through-direct-messages/?ncid=rss", "categories": "Hardware"}
{"description": "Because of heavy sanctions placed on the country for its nuclear weapons testing, North Korea has long run a series of &#8220;side businesses&#8221; like drug trafficking, endangered species trading, money laundering and currency counterfeiting to provide hard cash to the Kim regime. Naturally, bitcoin trading came next. Read More", "title": "Thank Kim Jong Un for your crypto gains", "author": "Danny Crichton", "publish_date": "Thu, 21 Dec 2017 19:22:18 +0000", "link": "https://techcrunch.com/2017/12/21/thank-kim-jong-un-for-your-crypto-gains/?ncid=rss", "categories": "Reviews"}
{"description": "When Nailab (Nairobi Incubation Lab) opened its doors seven years ago in Kenya, it wanted to be the Y Combinator for Kenya, Nailab CEO Sam Gichuru told me. In order to accomplish that goal, Gichuru realized Nailab would need a lot of money, which it did not have at the time. That&#8217;s why it initially began as a co-working space. Read More", "title": "Startup incubator Nailab invests $25K in East African startups", "author": "Megan Rose Dickey", "publish_date": "Thu, 21 Dec 2017 19:05:24 +0000", "link": "https://techcrunch.com/2017/12/21/startup-incubator-nailab-invests-25k-in-east-african-startups/?ncid=rss", "categories": "TC"}
{"description": "FabFitFun, the women&#8217;s lifestyle subscription service and media company that&#8217;s become a household name among influencers of a certain generation, is expanding its empire with the launch of a new video app for Apple TV and Amazon Fire. The Los Angeles company founded by Daniel and Michael Broukhim has become one of the darlings of the tech scene in Southern California. Read More", "title": "FabFitFun expands its empire with a new app for Apple TV and Amazon Fire", "author": "Jonathan Shieber", "publish_date": "Thu, 21 Dec 2017 18:53:25 +0000", "link": "https://techcrunch.com/2017/12/21/fabfitfun-expands-its-empire-with-a-new-app-for-apple-tv-and-amazon-fire/?ncid=rss", "categories": "Google"}
{"description": "We&#8217;ve only got a few more days until Christmas, and maybe you&#8217;re starting get a little nervous about all the folks who are still on your gift-giving list. Sure, they might not be your closest friends or best-loved family members&#8230; but you can&#8217;t ignore them entirely, can you? Don&#8217;t worry, TechCrunch has you covered. Whether you&#8217;ve got a lot of last-minute&hellip; Read More", "title": "Gift Guide: Last minute gifts and stocking stuffers that are actually good", "author": "Anthony Ha", "publish_date": "Thu, 21 Dec 2017 18:51:41 +0000", "link": "https://techcrunch.com/gallery/stocking-stuffers-2017/?ncid=rss", "categories": "google home"}
{"description": "Tesla is reworking its approach to in-car navigation, and will deploy a &#8220;major navigation overhaul&#8221; in &#8220;early 2018,&#8221; per Tesla CEO Elon Musk, who shared the news in response to a customer inquiry on Twitter. Musk added that the rollout will only take place after current testing underway is complete, but that it will be &#8220;light-years ahead&#8221; of the current&#8230; Read More", "title": "Tesla vehicles to get a “major navigation overhaul” in 2018", "author": "Darrell Etherington", "publish_date": "Thu, 21 Dec 2017 18:16:17 +0000", "link": "https://techcrunch.com/2017/12/21/tesla-vehicles-to-get-a-major-navigation-overhaul-in-2018/?ncid=rss", "categories": "Assistant"}
{"description": "Want to increase company value on the open market? Just change your name to something blockchain. At least, that worked for the Long Island Iced Tea Corp after changing its name to Long Blockchain Corp. In what is the most 2017 thing ever, company shares soared by as much as 500 percent in pre-market trading this morning after the company announced the name change. Read More", "title": "Long Island Iced Tea shares went gangbusters after changing its name to Long Blockchain", "author": "Sarah Buhr", "publish_date": "Thu, 21 Dec 2017 18:05:45 +0000", "link": "https://techcrunch.com/2017/12/21/long-island-iced-tea-shares-went-gangbusters-after-changing-its-name-to-long-blockchain/?ncid=rss", "categories": "Google Assistant"}
{"description": "Less than a year after joining Snapchat, social media nostalgia app Timehop&#8217;s founder Jonathan Wegener is departing the company. He tells TechCrunch he wants to build his own thing again, but the fact that the No. 1 teen social network isn&#8217;t exciting enough to stay at is telling. Read More", "title": "Talent trickles out of Snapchat as Timehop founder leaves", "author": "Josh Constine", "publish_date": "Thu, 21 Dec 2017 17:38:36 +0000", "link": "https://techcrunch.com/2017/12/21/timed-out/?ncid=rss", "categories": "google home max"}
{"description": "In case you wanted something engrossing to keep you distracted from family squabbles this holiday, a special gift just arrived: Civilization VI, which is now available as a $30 purchase for iPad via the App Store. The world building simulation game is possibly the most ambitious and expansive ever to hit the iPad, and it has hefty spec requirements to match &#8211; you&#8217;ll need at least&hellip; Read More", "title": "Civilization VI lands on iPad", "author": "Darrell Etherington", "publish_date": "Thu, 21 Dec 2017 17:35:24 +0000", "link": "https://techcrunch.com/2017/12/21/civilization-vi-lands-on-ipad/?ncid=rss", "categories": "smart speakers"}
{"description": "Want to buy someone a pair of headphones without accidentally buying them junk? We can help. Looking for something else? We can help with that, too. Here are some new releases and some old classics for your end-of-the-year holiday shopping. Read More", "title": "Gift Guide: 9 fantastic pairs of headphones", "author": "Lucas Matney", "publish_date": "Thu, 21 Dec 2017 17:30:50 +0000", "link": "https://techcrunch.com/gallery/gift-guide-9-fantastic-pairs-of-headphones/?ncid=rss", "categories": "Developer"}
{"description": "I&#8217;ve been following the rise of standing desks for a few years now and still use one on a daily basis. The technology hasn&#8217;t changed much in the decade or so that they&#8217;ve become truly popular but the design and quality is always improving which is why I took a look at the Kronos Lift from BDI. This is a surprisingly elegant desk with very little visible machinery &#8211;&hellip; Read More", "title": "The Kronos Lift standing desk brings a little class to getting off your chair", "author": "John Biggs", "publish_date": "Thu, 21 Dec 2017 16:50:57 +0000", "link": "https://techcrunch.com/2017/12/21/the-kronos-lift-standing-desk-brings-a-little-class-to-getting-off-your-chair/?ncid=rss", "categories": "TC"}
