{"description": "In the early days of streaming music services, some aimed to differentiate themselves by offering users the ability to upload their personal collection of MP3&#8217;s, which could be streamed alongside the on-demand streams and radio stations offered by the music service itself. Rdio, which later sold to Pandora, offered music uploads for matching purposes, for example. Amazon Music,&hellip; Read More", "title": "Amazon Music to end support for streaming your uploaded MP3s", "author": "Sarah Perez", "publish_date": "Wed, 20 Dec 2017 19:32:42 +0000", "link": "https://techcrunch.com/2017/12/20/amazon-music-to-end-support-for-streaming-your-uploaded-mp3s/?ncid=rss", "categories": ["TC"]}
{"description": "As cryptocurrency fever grips the tech world, and blockchain technologies gradually become more viable, there is a new wave of accelerators and incubators appearing to service this growing ecosystem. Some are covering funding and services, some are about services only. It&#8217;s fair to assume, however, that some kinds of cryptocurrency will be changing hands, of course, not to mention the&hellip; Read More", "title": "The rise of the Crypto accelerators", "author": "Mike Butcher", "publish_date": "Wed, 20 Dec 2017 19:21:20 +0000", "link": "https://techcrunch.com/2017/12/20/the-rise-of-the-crypto-accelerators/?ncid=rss", "categories": ["Cryptocurrency"]}
{"description": "Earlier this year, Microsoft shut down Photosynth, its service for stitching multiple images into panoramas and semi-3D models. When it launched in 2008, the service was extremely impressive, but it never quite caught on. Still, it had its fans &#8212; and now Microsoft is bringing it back in the form of a new feature in its Pix camera app for iOS. In addition, the Pix app is also getting a&hellip; Read More", "title": "Photosynth returns as a feature in Microsoft’s Pix camera app", "author": "Frederic Lardinois", "publish_date": "Wed, 20 Dec 2017 19:18:17 +0000", "link": "https://techcrunch.com/2017/12/20/photosynth-returns-as-a-feature-in-microsofts-pix-camera-app/?ncid=rss", "categories": ["Europe"]}
{"description": "UBTECH&#8217;s Stormtrooper missed Force Friday and The Last Jedi&#8217;s release &#8212; no surprise, really. The robotic toy moves pretty slowly, all things told. Perhaps it was a matter of getting things just right, or maybe it was the pains of dealing with such a high-profile license for the first time. Whatever the case, the Chinese robotics startup has just taken the wraps off one last&hellip; Read More", "title": "UBTECH’s robotic First Order Stormtrooper patrols AR battlefields", "author": "Brian Heater", "publish_date": "Wed, 20 Dec 2017 19:17:37 +0000", "link": "https://techcrunch.com/2017/12/20/ubtechs-robotic-first-order-stormtrooper-patrols-ar-battlefields/?ncid=rss", "categories": ["TC"]}
{"description": "Chip, the chatbot app that plugs into your bank account and lets you automatically save for a rainy day, has raised nearly £1.1 million on equity crowdfunding platform Crowdcube. The fund raise, which is part of a larger £2.4 million funding round, forms part of plans for the London-based startup to apply for a banking license. Read More", "title": "Chip, the chatbot savings app, raises over £1M in crowdfunding with plans to apply for a banking license", "author": "Steve O&#039;Hear", "publish_date": "Wed, 20 Dec 2017 19:16:24 +0000", "link": "https://techcrunch.com/2017/12/20/chip-and-crowdfund/?ncid=rss", "categories": ["crypto"]}
{"description": "Because of a Reddit post and the loose interpretation of subsequent benchmark tests posted by Primate Labs&#8217; John Poole, the &#8220;Apple throttles old iPhones&#8221; meme has reared its ugly head again. The gist, as it always is, is that Apple is being super petty and trying to force customers to upgrade their phones by making their old phones run slower. Read More", "title": "Apple addresses why people are saying their iPhones with older batteries are running ‘slower’", "author": "Matthew Panzarino", "publish_date": "Wed, 20 Dec 2017 19:11:48 +0000", "link": "https://techcrunch.com/2017/12/20/apple-addresses-why-people-are-saying-their-iphones-with-older-batteries-are-running-slower/?ncid=rss", "categories": ["waves"]}
{"description": "The Republican tax bill is ready for the president&#8217;s signature. After forcing its second vote in two days, the bill passed the House with a vote of 224 to 201. The bill previously cleared the Senate with a narrow 51-48 vote along party lines, though Republican Senator John McCain was unable to cast a vote as he undergoes cancer treatment in his home state. Now the only thing standing&hellip; Read More", "title": "Tech’s massive tax cut Christmas present from Trump just cleared Congress", "author": "Taylor Hatmaker", "publish_date": "Wed, 20 Dec 2017 19:08:32 +0000", "link": "https://techcrunch.com/2017/12/20/tech-tax-cuts-republican-tax-bill/?ncid=rss", "categories": ["blockchain"]}
{"description": "A mom from Arkansas, a major donor to Republican causes with very little experience in technology, wants to invest $50,000 in bitcoin. A man from Switzerland curses during a Skype call because his Korean over-the-counter exchange went down during a massive trade. An entrepreneur placed a Trezor bitcoin wallet worth $150,000 on his car key chain. Another futurist is Tweeting late at night about&hellip; Read More", "title": "Cryptocurrencies have an everything problem", "author": "John Biggs", "publish_date": "Wed, 20 Dec 2017 18:48:11 +0000", "link": "https://techcrunch.com/2017/12/20/cryptocurrencies-have-an-everything-problem/?ncid=rss", "categories": ["Apps"]}
{"description": "Netflix will launch its first streaming-only franchise, with the news (via Bloomberg) that it&#8217;s greenlit a sequel to Will Smith film Bright, which is set to stream beginning December 22. Bright has the budget of a Hollywood blockbuster, and a fantasy setting that could be a good fit for an episodic film franchise, given what has traditionally done well with fans in terms of big-budget&#8230; Read More", "title": "Netflix is turning Will Smith streaming original ‘Bright’ into a film franchise", "author": "Darrell Etherington", "publish_date": "Wed, 20 Dec 2017 18:34:22 +0000", "link": "https://techcrunch.com/2017/12/20/netflix-is-turning-will-smith-streaming-original-bright-into-a-film-franchise/?ncid=rss", "categories": ["Mobile"]}
{"description": "While we won&#8217;t call this a huge watershed moment per se, something nominally interesting in the world of Weird Social Media Things happened this morning: Snap and Twitter are now worth the same based on their market caps. With some small moves on both companies&#8217; shares, both companies are now hovering around $18.7 billion in market cap. There are some extra mechanics that go into&hellip; Read More", "title": "Snap and Twitter now have roughly the same market cap", "author": "Matthew Lynley", "publish_date": "Wed, 20 Dec 2017 18:07:32 +0000", "link": "https://techcrunch.com/2017/12/20/snap-and-twitter-now-have-roughly-the-same-market-cap/?ncid=rss", "categories": ["TC"]}
{"description": "Passport, company that&#8217;s managing much of the technical aspects of how people pay to use public transportation resources in cities like London, Miami and Los Angeles, has just raised $43 million. The money, from Bain Capital Ventures, will go to help the company expand its payment and transaction services nationally and internationally. Read More", "title": "Passport, the technology business for city transit systems, raises $43 million", "author": "Jonathan Shieber", "publish_date": "Wed, 20 Dec 2017 18:06:19 +0000", "link": "https://techcrunch.com/2017/12/20/passport-the-technology-business-for-city-transit-systems-raises-43-million/?ncid=rss", "categories": ["Microsoft"]}
{"description": "Erato, one of the first companies to make and sell fully wireless earbuds, has a new product available called the Verse that&#8217;s more affordable than its flagship Apollo 7 buds, but with great sound quality, a lighter form factor, and innovative graphene drivers that provide quality audio with fewer compromises. The small, bullet-shaped earbuds are a good alternative for would-be AirPod&#8230; Read More", "title": "Erato’s lightweight Verse wireless earbuds deliver solid sound at a good price", "author": "Darrell Etherington", "publish_date": "Wed, 20 Dec 2017 18:04:54 +0000", "link": "https://techcrunch.com/2017/12/20/eratos-lightweight-verse-wireless-earbuds-deliver-solid-sound-at-a-good-price/?ncid=rss", "categories": ["microsoft pix"]}
{"description": "Last month, the movie subscription service MoviePass, which lets customers go to unlimited movies in theaters for a monthly fee, lowered its pricing to under $7 per month, when billed annually. This followed an earlier price drop announced in August that brought the service down to $9.95 monthly. Today, the company says the introduction of its new pricing model has pushed membership to over&hellip; Read More", "title": "MoviePass tops 1 million subscribers", "author": "Sarah Perez", "publish_date": "Wed, 20 Dec 2017 17:40:19 +0000", "link": "https://techcrunch.com/2017/12/20/moviepass-tops-1-million-subscribers/?ncid=rss", "categories": ["App"]}
{"description": "The long search is over for Uber&#8217;s chief operating officer. Former Orbitz CEO Barney Harford has formally accepted the position today. 1/ Thrilled to be joining @Uber as COO. Looking fwd to working w @dkhos again to help @Uber achieve its full potential https://t.co/gdnXJfFrjS &#8212; Barney Harford (@barneyh) December 20, 2017 In early March, former CEO Travis Kalanick disclosed he&hellip; Read More", "title": "Uber appoints former Orbitz CEO Barney Harford as chief operating officer", "author": "Sarah Buhr", "publish_date": "Wed, 20 Dec 2017 17:10:24 +0000", "link": "https://techcrunch.com/2017/12/20/uber-appoints-former-orbitz-ceo-as-chief-operating-officer/?ncid=rss", "categories": ["Photosynth"]}
{"description": "If you own an Amazon Fire TV, you can now use Firefox to browse the web on your TV. As Mozilla and Amazon announced today, Firefox, which joins Amazon&#8217;s own Silk browser on the device, is now available for all your browsing needs. &#8220;Bringing Firefox to Fire TV is an exciting new way to reach our users and serve up more of the full web to everyone,&#8221; said Mark Mayo,&hellip; Read More", "title": "Firefox lands on Amazon’s Fire TV", "author": "Frederic Lardinois", "publish_date": "Wed, 20 Dec 2017 17:04:28 +0000", "link": "https://techcrunch.com/2017/12/20/firefox-lands-on-amazons-fire-tv/?ncid=rss", "categories": ["iOS"]}
{"description": "TechCrunch Startup Battlefield is headed to Dubai on its continuing quest to find and feature the best early-stage startups around the world. Slated for April 2018, Startup Battlefield Dubai will feature global startups with a focus on three categories: governance, logistics and distribution. Startups from all over the world are invited to apply to compete. TechCrunch will host the event in&hellip; Read More", "title": "TechCrunch to host Startup Battlefield in Dubai with Area 2071", "author": "Samantha Stein", "publish_date": "Wed, 20 Dec 2017 17:00:15 +0000", "link": "https://techcrunch.com/2017/12/20/techcrunch-to-host-startup-battlefield-in-dubai-with-area-2071/?ncid=rss", "categories": ["Augmented Reality"]}
{"description": "Most dating apps match users then leave it up to them to initiate their chat. When Bumble launched, however, it broke new ground by having women make the first move. Today, Hinge is introducing its own take on how conversations on dating apps should be handled with a new feature it&#8217;s calling &#8220;Your Turn.&#8221; The idea with &#8220;Your Turn&#8221; is that it lets users decide&hellip; Read More", "title": "Dating app Hinge rolls out a new feature to reduce ‘ghosting’", "author": "Sarah Perez", "publish_date": "Wed, 20 Dec 2017 16:36:37 +0000", "link": "https://techcrunch.com/2017/12/20/dating-app-hinge-rolls-out-a-new-feature-to-reduce-ghosting/?ncid=rss", "categories": ["Robotics"]}
{"description": "Revoice.me is a new service that makes it easy to give readers, listeners and viewers the option to subscribe to your content &#8212; newsletter, blog, podcast or YouTube channel &#8212; via Facebook Messenger. Because, as we end 2017, messaging apps is where a significant proportion of your audience is at. Or so the thinking goes. Read More", "title": "Revoice.me offers a simple way to let your blog and newsletter readers subscribe via Facebook Messenger", "author": "Steve O&#039;Hear", "publish_date": "Wed, 20 Dec 2017 16:29:23 +0000", "link": "https://techcrunch.com/2017/12/20/revoice-me-offers-a-simple-way-to-let-your-blog-and-newsletter-readers-subscribe-via-facebook-messenger/?ncid=rss", "categories": ["TC"]}
{"description": "After weeks of back-and-forth negotiations between Republicans who represent rich people and Republicans who represent other rich people, Congress is in the final process of voting on a tax bill that will help all rich people at the same time, while benefitting working families that depend on rich people for their jobs and income.\nBut hey, the standard deduction is going up so eat your&#8230; Read More", "title": "The rich can breathe a sigh of relief", "author": "Danny Crichton", "publish_date": "Wed, 20 Dec 2017 16:27:57 +0000", "link": "https://techcrunch.com/2017/12/20/the-rich-can-breathe-a-sigh-of-relief/?ncid=rss", "categories": ["star wars"]}
{"description": "Digital ad spending continued to grow during the first six months of 2017, according to the latest Internet Advertising Revenue Report. The report was prepared by PricewaterhouseCoopers for the Interactive Advertising Bureau, a trade group of online advertisers and publishers. It shows that digital ad revenue in the United States reached $40.1 billion in the first half of this year.&hellip; Read More", "title": "Digital ad spend grew 23 percent in the first six months of 2017, according to IAB", "author": "Anthony Ha", "publish_date": "Wed, 20 Dec 2017 16:16:29 +0000", "link": "https://techcrunch.com/2017/12/20/iab-ad-revenue-report-2017/?ncid=rss", "categories": ["Star Wars toys"]}
